Repository: 84000/data-translation-memory
Catalog: toh467-v3.tmx
Source language: bo
Languages: en

source: ཟླ་བའི་དཀྱིལ་འཁོར་དབུས་སུ་ནི། །ལྷ་མོ་བཞི་པོ་རབ་བསྒོམ་བྱ། །
en: The four goddesses should be visualized Standing on moon disks.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གསུང་ཐུགས་གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་རྗེས་སུ་དྲན་པ་རིམ་པར་ཕྱེ་བ་སྟེ་བཅུ་བའོ།། །།
en: This was the tenth chapter, “Cultivating the Recollection for Mastering Vetālas,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: ཞེ་སྡང་གིས་མནན་འགྲོ་མཐོང་ནས། །ཞེ་སྡང་གཤིན་རྗེའི་གཤེད་གཟུགས་སུ། །བཅོམ་ལྡན་གཤིན་རྗེའི་དབང་དུ་མཛད། །ཞེ་སྡང་ཐམས་ཅད་ཟད་པར་བྱེད། །
en: Chapter 11: Revealing the Conduct “Seeing that beings are overcome with hatred, The Bhagavat, taking the form of Dveṣa Yamāri, Brings Yama under control And lays waste to all hatred.

source: གཏི་མུག་གིས་མནན་འགྲོ་མཐོང་ནས། །གཏི་མུག་གཤིན་རྗེའི་གཤེད་གཟུགས་སུ། །བཅོམ་ལྡན་གཤིན་རྗེའི་དབང་མཛད་ནས། །གཏི་མུག་ཐམས་ཅད་ཟད་པར་མཛད། །
en: “Seeing that beings are overcome with ignorance, The Bhagavat, taking the form of Moha Yamāri, Brings Yama under control And lays waste to all ignorance.

source: འགྲོ་བ་ཕྲ་མས་མནན་མཐོང་ནས། །ཕྲ་མ་གཤིན་རྗེའི་གཤེད་གཟུགས་སུ། །བཅོམ་ལྡན་སྙིང་རྗེ་ཅན་གྱིས་མཛད། །ཕྲ་མ་ཐམས་ཅད་ཟད་པར་མཛད། །
en: “Seeing that beings are overcome with miserliness, The Bhagavat, moved by compassion, Takes the form of Piśuna Yamāri And lays waste to all miserliness.

source: འདོད་ཆགས་ཀྱིས་མནན་འགྲོ་མཐོང་ནས། །འདོད་ཆགས་གཤིན་རྗེའི་གཤེད་གཟུགས་སུ། །བཅོམ་ལྡན་སྙིང་རྗེ་ཅན་མཛད་ནས། །འདོད་ཆགས་ཐམས་ཅད་ཟད་པར་མཛད། །
en: “Seeing that beings are overcome with desire, The Bhagavat, moved by compassion, Takes the form of Rāga Yamāri And lays waste to all desire.

source: ཕྲག་དོག་གིས་མནན་འགྲོ་མཐོང་ནས། །ཕྲག་དོག་གཤིན་རྗེའི་གཤེད་གཟུགས་སུ། །བཅོམ་ལྡན་སྙིང་རྗེ་ཅན་མཛད་ནས། །ཕྲག་དོག་ཐམས་ཅད་ཟད་པར་མཛད། །
en: “Seeing that beings are overcome with jealousy, The Bhagavat, moved by compassion, Takes the form of Īrṣyā Yamāri And lays waste to all jealousy.

source: བྱམས་པ་ཙརྩི་ཀཱར་གསུངས་ཏེ། །སྙིང་རྗེ་དེ་བཞིན་ཕག་མོའོ། །དབྱངས་ཅན་མ་ནི་དགའ་བ་སྟེ། །བཏང་སྙོམས་གཽ་རཱིའི་གཟུགས་སོ། །
en: “Carcikā is said to be love, Vārāhī is compassion, Sarasvatī is joy, While Gaurī embodies equanimity.

source: བདག་ཉིད་དངོས་པོ་ཐམས་ཅད་ཀྱིས། །རྫོགས་པར་བྱས་ནས་དཀྱིལ་འཁོར་གྱི། །རྣལ་འབྱོར་སྙིང་གའི་ས་བོན་སྤྲོ། །འགྲུབ་པར་འདི་ལ་ཐེ་ཚོམ་མེད། །
en: “The yogin, themselves perfected As all those present in the maṇḍala, Radiates from the seed syllable and their hearts; Success ensues, there is no doubt.

source: དེ་ནས་ད་ནི་བཤད་བྱ་བ། །སྤྱོད་པ་ཡི་ནི་མཚན་ཉིད་མཆོག །གཤིན་རྗེའི་གཤེད་པོ་འཇིགས་གཟུགས་ཀྱིས། །སྐུ་དང་གསུང་དང་ཐུགས་སུ་འགྲུབ། །
en: “I will now explain The supreme qualities of the conduct That perfects body, speech, and mind Through Yamāri’s terrifying form.

source: དགོན་པ་ཆེན་པོའི་ས་ཕྱོགས་སུ། །མ་ཧེ་མཆོག་ནི་བཀུག་ལ་ཞོན། །སྦྲུལ་དག་གིས་ནི་བརྒྱན་པར་བྱ། །ལྕགས་ཀྱི་རྡོ་རྗེ་གཟུགས་པར་བྱ། །
en: “In a vastly forested area, One should call and mount a supreme buffalo, Adorn themselves with snakes, And take up an iron vajra.

source: སྐྲ་ཡང་སེར་པོ་དག་ཏུ་བྱ། །གྱེན་བརྫེས་པ་ཡི་ཁྱད་པར་གྱིས། །
en: “One should also turn their hair yellow, Which should specifically flow upwards.

source: མགོ་ལ་ཐོད་པས་ཡང་དག་བསྐོར། །སྨ་ར་ལྐོག་སྤུ་སེར་པོར་བྱ། །
en: Skulls should ring their head And their beard should be turned yellow.

source: ཧྲཱིཿཥྚྲཱིཿལ་སོགས་སྔགས་བརྗོད་ཅིང་། །ལྕགས་ཀྱི་རྡོ་རྗེ་མཁའ་ལ་གསོར། །རྡོ་རྗེ་གཤིན་རྗེའི་གཤེད་སྦྱོར་བས། །སེང་གེའི་སྒྲ་ཡང་དེ་ལ་བྱ། །
en: “While brandishing the iron vajra, One should recite the mantra beginning hrīḥ ṣṭrīḥ And roar a lion’s roar, While applying the practice of Vajra Yamāri.

source: ནུས་པ་ཅུང་ཟད་སྐྱེས་པ་ན། །རོལ་ཅིང་གྲོང་དུ་འཇུག་པར་བྱ། །
en: “Once a little power develops, One should playfully enter a village.

source: གར་དང་བདེ་བའི་ཆ་ཀུན་གྱིས། །དྲུག་ལས་སྐྱེད་སོགས་གླུ་བླང་བྱ། །
en: One should dance and ecstatically sing Songs using ṣāḍava and other scales.

source: དེ་ནས་རྒྱལ་མཚན་ཁྱམས་མཐོང་ན། །དེར་ནི་འོ་མ་རབ་བསྒྲུབ་བྱ། །
en: “Seeing a row of banners, One should perfect the milk there.

source: འོ་མ་ལ་སེམས་གཅིག་གོམས་པས། །ཕྱག་རྒྱ་ཆེན་པོ་རབ་བསྒྲུབ་བྱ། །
en: By focusing one-pointedly on the milk, One will attain mahāmudrā.

source: ཕག་མོ་ཡི་ནི་གཟུགས་བཟུང་བའི། །བཙུན་མོ་ཀུན་ལ་འཁྱུད་པ་ཡིས། །དཔའ་མོ་སེང་གེ་བཞིན་དུ་སྤྱད། །འདོད་པའི་དོན་ཀུན་རབ་ཏུ་འགྲུབ། །
en: “By embracing any woman Who has taken the form of Vārāhī, The courageous one acts like a lion And accomplishes all desired aims.

source: དེ་ནས་ད་ནི་བཤད་བྱ་བ། །ཕྱག་རྒྱ་མ་ནི་རབ་སྒྲུབ་ཐབས། །གསང་སྔགས་ཆེན་པོ་ཡི་གེ་གཅིག །དེ་ཡི་བཟླས་པ་མངོན་པར་བཤད་བྱ། །
en: “Next, I will explain The method for the Hundred-Armed One And will describe the recitation Of the great one-syllable mantra.

source: ཡི་གེ་ཧྲཱིཿལས་བྱུང་བ་ཡི། །མ་ཧེ་ཡང་དག་བསྒོམ་བྱ་སྟེ། །
en: “One should visualize the Buffalo-Faced One Manifesting from the syllable hrīḥ.

source: རྡོ་རྗེ་དཀྱིལ་འཁོར་ལ་གནས་པ། །མ་ཧེ་སྟེང་དུ་བསྒོམ་པར་བྱ། །
en: He stands on a vajra maṇḍala And is mounted on a buffalo.

source: གང་ཡང་ཅུང་ཟད་གཅོད་ཅིང་འབིགས། །མཚོན་ཆ་སྣ་ཚོགས་གཟུགས་དེ་ནི། །མ་ཧེ་སྣ་ཚོགས་བསྒྲུབ་པ་ཡི། །བློ་དང་ལྡན་པའི་ཕྱག་ན་བསྣམས། །
en: “The adept who practices The mantra of the Buffalo-Faced One Should imagine him holding various weapons— Those that cut and those that pierce.

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །དབྱིག་པ་གཤིན་རྗེའི་གཤེད་སྒྲུབ་ཐབས། །
en: “Next, I will explain, The practice of Daṇḍa Yamāri.

source: ཡི་གེ་ཧྲཱིཿནི་གསང་སྔགས་ཆེ། །མ་ཧེ་ཆེན་པོ་ལ་བཅིབས་པ། །
en: The syllable hrīḥ is his great mantra And he has a buffalo as his mount.

source: ཕྱག་ནི་འབུམ་ཕྲག་རྫོགས་པའི་ཕྱག །སྐུ་ནི་མི་རོའི་ཐལ་བས་བསྐུས། །རི་རབ་དང་ནི་མཉམ་པའི་ལུས། །གསེར་གྱི་ས་གཞི་ཐུག་པར་མནན། །
en: “He is arrayed with two-hundred-thousand arms And his body, smeared with human ashes, Is as high as Mount Sumeru And reaches down to the golden ground.

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །བྱེ་བའི་ཕྱག་ཅན་སྒྲུབ་པའི་ཐབས། །
en: “Next, I will explain The method for the Ten-Million-Armed One.

source: ཡི་གེ་ཧཱུྃ་ལས་བྱུང་བའི་གཙོ། །ཝིཀྲྀ་ཏཱ་ན་གསང་སྔགས་ཆེ། །
en: He is the lord arisen from the syllable hūṁ And vikṛtānana is his great mantra.

source: ཨོྃ་ཧྲཱིཿཥྚྲཱིཿཝིཀྲྀ་ཏཱ་ནན་ཧཱུྃ་ཧཱུྃ་ཕཊ་ཕཊ་ཧ་ཧཱ་ཧི་ཧཱི་ཧུ་ཧཱུ་ཧེ་ཧཻ་ཧཽ་ཧྃ་ཧཿཕཊ་སྭཱ་ཧཱ། དགོས་པ་ཐམས་ཅད་བསྒྲུབ་པ་ཡི། །དམ་ཚིག་སྒྲུབ་ཐབས་བཤད་པར་བྱ། །
en: oṁ hrīḥ ṣṭrīḥ vikṛtānana hūṁ hūṁ phaṭ phaṭ ha hā hi hī hu hū he hai ho hau haṁ haḥ phaṭ svāhā | “I will explain the samaya practice That accomplishes all aims.

source: སྔགས་ཀྱིས་དུབ་པས་ཁ་ཟས་བཟའ། །ངན་པ་དང་བྲལ་རྙེད་དཀའ་མིན། །ཤ་ཆེན་དག་ནི་རྟ་དང་ནི། །
en: The food for those exhausted by the mantra Is easy to obtain and beyond reproach.

source: གླང་པོ་ཆེ་ཡི་ཁྱད་པར་དང་། །བ་ལང་གི་དང་ཁྱི་དང་ནི། །བོང་བུ་རྔ་མོ་ཅེ་སྤྱང་ངོ་། །སྔོན་པོ་དང་ནི་བསྲེས་པ་ཡི། །སྣུམ་ཆེན་གྱིས་ནི་ལུས་བྱུགས་ན། །
en: “One should mix great flesh, With horse and especially elephant, As well as cow and dog, Donkey, camel, jackal, “And the indigo plant, And then rub it on one’s body with great oil.

source: ལུས་ལ་བྱུགས་པ་ཙམ་གྱིས་ནི། །འགྲོ་བ་ཐམས་ཅད་དབང་དུ་འགྱུར། །སྣང་མཛད་སི་དུ་བ་ར་དང་། །
en: One can enthrall the world Simply by rubbing it on one’s body.

source: དེ་བཞིན་བིལ་བའི་ལོ་མ་དང་། །སོ་ཕག་ཕྱེ་མ་བསྲེས་པ་དང་། །གསེར་ཤིང་ལོ་མའི་ཁུ་བ་རྣམས། །འདི་ཡིས་དྲིལ་ཕྱིས་བྱས་གྱུར་ན། །
en: “One should mix vairocana and sinduvāra, As well as bilva leaves, A mixture of powdered brick, And the juice of kanaka leaves.

source: ཁམས་གསུམ་པོ་ནི་དབང་དུ་འགྱུར། །
en: “Simply by rubbing this on their limbs One will enthrall the three worlds.

source: དུག་དང་ཆུ་བུར་དེ་བཞིན་མཛེ། །དྲིལ་ཕྱིས་བྱས་པས་ཉམས་པར་བྱེད། །
en: Poison, blisters, as well as leprosy Are cured when one is smeared with it.

source: གཅི་བ་ཆེན་པོ་བཏུང་བར་བྱ། །རྡོ་རྗེ་བདུད་རྩི་དེ་བཞིན་དུ། །
en: “One should drink the great urine As well as vajra nectar.

source: འདི་ནི་རྣལ་འབྱོར་མཆོག་གཙོ་བོ། །རང་འབྱུང་མེ་ཏོག་བཏུང་བ་བཞིན།
en: This is the highest, best yoga, As is drinking the self-arisen flower.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གསུང་ཐུགས་གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་སྤྱོད་པ་སྟོན་པ་ཞེས་བྱ་བའི་རྒྱུད་རིམ་པར་ཕྱེ་བ་སྟེ་བཅུ་གཅིག་པའོ། །
en: This was the eleventh chapter, “Revealing the Conduct,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྐྱེས་བུ་ཆེན་པོའི་དམ་ཚིག་རྡོ་རྗེ་སེམས་དཔའི་ངོ་བོ་ཙརྩི་ཀཱའི་རྣམ་པའི་ཏིང་ངེ་འཛིན་ལ་ཡང་སྙོམས་པར་ཞུགས་ཤིང་། ཕག་མོའི་རྣམ་པའི་ཏིང་ངེ་འཛིན་ལ་ཡང་སྙོམས་པར་ཞུགས་སོ། །དབྱངས་ཅན་གྱི་རྣམ་པའི་ཏིང་ངེ་འཛིན་ལ་ཡང་སྙོམས་པར་ཞུགས་སོ། །གཽ་རི་མའི་རྣམ་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ། མཆོད་པའི་གླུ་འདི་དག་རྗོད་པར་མཛད་དོ། །
en: Chapter 12: All the Unique Ancillary Rites Then, the blessed Mahāpuruṣasamaya, Vajrasattva in essence, entered the meditative absorption of Carcikā’s form, then Vārāhī’s form, then Sarasvatī’s form, then Gaurī’s form, and performed these songs of offering: “Hey, Black Yamāri!

source: ཨ་ཀྱེ་ཀྱེ་གཤིན་རྗེའི་གཤེད་ནག་བླ། །
en: Master!

source: སྲིན་པོའི་གཟུགས་ཅན་རང་བཞིན་ཁྱོད། །
en: You have the nature and form of a rākṣasa.

source: བདག་གིས་ཁྱོད་མཐོང་ཤིན་ཏུ་འཇིགས། །ཁྲོ་བའི་རང་བཞིན་འདི་ཐོང་མཛོད། །
en: I am terrified when I look at you, Please cast off this wrathful nature!

source: མཐོ་རིས་ས་སྟེངས་ས་འོག་བཅས། །ཁྱོད་ཀྱི་གར་གྱིས་གཡོས་པར་མཛད། །
en: “The heavens, earth, and underworld Quake from your dance.

source: ཨཉྫ་ནག་པོ་བཅག་འདྲ་བའི། །ཁྲོ་ཁྱོད་རོ་ལངས་ཞི་གར་མཛོད། །
en: Wrathful one, black as collyrium, You dance to appease the vetālas.

source: རྣམ་པ་སྣ་ཚོགས་གཟུགས་སྤྲུལ་ཞིང་། །མདངས་ནག་ཚད་ནི་ཐུང་བ་ལ། །
en: “Of dark, complex, and dwarfish stature, You emanate a variety of different forms.

source: བདེ་ཆེན་ངོ་བོ་ཁྲོ་གར་གྱིས། །
en: Essence of great bliss, dance!

source: རྡོ་རྗེ་དབྱངས་ཅན་མ་གསོལ་འདེབས། །
en: I, Vajrasarasvatī, supplicate you.

source: ཧྲཱིཿཥྚྲཱི་སྔགས་དང་གར་གྱིས་ཁྱོད། །སྲིད་པ་གསུམ་གྱི་འཁྲུལ་པ་ཆོད། །
en: “With the hrīḥ ṣṭrīḥ mantra and your dance, You cut through the confusion of the three existences.

source: སྙིང་རྗེ་ཁྲོས་པའི་དང་སྒྲོལ་གར། །འགྲོ་བས་དད་ནི་ངོ་མཚར་འགྱུར། །
en: Your liberating dance of compassionate wrath Fills the world with faith and wonder.

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །བཟླས་པ་ཡི་ནི་མཚན་ཉིད་མཆོག །
en: “Next, I will explain The supreme characteristics of mantra recitation.

source: བཟླས་པ་གང་ཞིག་རབ་བཟླས་ན། །དངོས་གྲུབ་ཡངས་པ་ཐོབ་པ་ནི། །
en: Those who apply this mantra recitation Will attain vast siddhis.

source: མྱུར་བར་མ་ཡིན་དལ་བར་མིན། །རིང་དུ་མ་ཡིན་ཐུང་ངུ་མིན། །སྔགས་ནི་ཅུང་ཟད་ཐོས་པར་བཟླས། །གཤིན་རྗེ་སློབ་དཔོན་མི་མཆོག་གི། །
en: “Neither too quickly nor too leisurely, Neither too long nor too short, For the master of Yama, the supreme person, The recitation should be barely audible.

source: མ་ཧེ་མི་དང་སོ་གཉིས་དང་། །བ་ལང་དང་ནི་རྟ་དག་དང་། །བོང་བུ་རྔ་མོའི་རུས་པ་ལས། །བཟླས་པའི་ཕྲེང་བ་རབ་བསྒྲུབ་བྱ། །
en: “The recitation mālā should be made From buffalo or human bones, Or those of an elephant, cow, horse, Donkey, or camel.

source: ཟླ་ངོ་གཅིག་གི་བཅུ་བཞི་ལ། །བདུད་རྩི་ལྔ་དང་ལྡན་པ་ཡིས། །ཤ་ལྔ་དག་ནི་བསྡུ་བྱས་ནས། །
en: “On the fourteenth day of the first month, One should gather the five meats Mixed with the five nectars.

source: བཟླས་ན་དངོས་གྲུབ་འགྲུབ་པའི་མཆོག །
en: Recitation then leads to the supreme siddhi.

source: རིལ་བུ་དག་ནི་སོ་སོ་ལ། །རྣལ་འབྱོར་པ་ཡིས་གཤིན་གཤེད་བསྒོམ། །
en: “The yogi should visualize Yamāri inside each bead.

source: མཁས་པས་ནི་ཡང་མི་མགོ་སྟེ། །ཁྲག་གིས་བཀང་བའི་མགོ་བསྒོམ་བྱ། །
en: Or, the adept can visualize them As human heads covered in blood.

source: ཁྲི་ཙམ་གྱིས་ནི་འབྱུང་པོ་རྣམས། །
en: “When applying the practice of Vajra Yamāri, Bhūtas will die after 10,000 recitations.

source: མཁའ་འགྲོ་མ་རྣམས་སྟོང་ཕྲག་གིས། །བདུད་དང་ཡི་དགས་ཚོགས་ཀྱང་འཆི། །
en: Ḍākinīs will die after one thousand, As will the hosts of māras and pretas.

source: གཤིན་གཤེད་རྡོ་རྗེའི་སྦྱོར་བ་ཡིས། །རྣལ་འབྱོར་བདག་ཉིད་འབུམ་བཟླས་ནས། །དེས་ནི་ལས་ཀུན་བྱེད་པ་ཡིན། །
en: “After 100,000 recitations, the one immersed in yoga Can perform any of the ritual activities.

source: བྱེ་བ་བཟླས་ནས་དངོས་གྲུབ་སྟེར། །བྱེ་བ་ལྔ་བཟླས་སྨོས་ཅི་དགོས། །
en: After ten million repetitions, they will be granted siddhis, To say nothing of fifty million.

source: ཉིན་རེའམ་ཡང་ན་ཟླ་རེ་འམ། །དེ་བཞིན་ལོ་ནི་རེ་རེ་ལ། །གཏོར་མ་དྲུག་ཅུ་རྩ་བཞི་སྦྱིན། །དབྱུག་གུ་དྲུག་ཅུ་རྩ་བཞིར་ཤེས། །
en: “Every day, every month, Or even every year, The adept should make sixty-four bali offerings At the sixty-four daṇḍas.

source: རྟག་ཏུ་ཅུང་ཟད་ཅི་ཟ་དང་། །དེ་བཞིན་ཅུང་ཟད་འཐུང་བ་དང་། །གཞན་ཡང་བཟའ་བ་ཐམས་ཅད་ཀྱི། །ཕུད་ནི་གཤིན་རྗེའི་གཤེད་ལ་དབུལ། །
en: “Whenever one has a little something to eat, When they have little something to drink, Or when they enjoy a full meal, The best part should be offered to Yamāri.

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །བླ་མ་ལ་ནི་ཡོན་དབུལ་བའོ། །ལས་ནི་ཐམས་ཅད་བསྒྲུབ་པ་དང་། །བདག་ཉིད་ཞི་བར་བྱ་བའི་ཕྱིར། །བདག་ཉིད་ཀྱང་ནི་དབུལ་བ་དང་། །
en: “Now, I will explain the gifts That are to be offered to the master In order to accomplish all activities And to pacify oneself.

source: རྟ་དང་བ་དང་གླང་པོ་དང་། །གསེར་དང་དེ་ལས་གཞན་པ་དང་། །རང་གི་ཆུང་མ་དེ་བཞིན་བུ། །མ་དང་སྲིང་མོ་ཚ་མོ་དང་། །དེ་བཞིན་དུ་ནི་སྤུན་ཟླ་དང་། །
en: “The vow-holder should offer themselves, As well as a horse, cow, or elephant, Or gold, and beyond that, Their own spouse and children, Their mother, sisters, and nieces, As well as their brothers.

source: ན་བཟའ་སྣ་ཚོགས་དག་དང་ནི། །གདུགས་དང་རྡུལ་ཡབ་མཛེས་པ་དང་། །ཁྱིམ་དང་གདན་དང་དྲི་ཞིམ་དང་། །དེ་བཞིན་གླུ་དང་རོལ་མོ་དང་། །རལ་གྲི་དང་ནི་རྒྱན་དག་དང་། །
en: “One should offer different articles of clothing, A parasol and elegant tail whisk, A home, a seat, and fragrances, As well as songs and music, A sword and jewelry.

source: བརྟུལ་ཞུགས་ཅན་གྱིས་བླ་མར་དབུལ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གསུང་ཐུགས་གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་ཉེ་བར་མཁོ་བའི་ལས་ཀྱི་ཁྱད་པར་ཐམས་ཅད་ཞེས་བྱ་སྟེ་རིམ་པར་ཕྱེ་བ་བཅུ་གཉིས་པའོ།། །།
en: This was the twelfth chapter, “All Unique Ancillary Rites,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: དེ་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །སྡིག་པ་དག་ནི་ཇི་སྙེད་པ། །དེ་དག་གཅོད་པའི་གྲི་གུག་སྟེ། །ཞེ་སྡང་གཅོད་པའི་ཤུབས་ཅན་ནོ། །
en: Chapter 13: Identifying the Siddhis “Now, the knife that severs The evil deeds of beings, However many there are, Is the sword that cuts through anger.

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །རིང་བའི་ཐོས་པ་བསྒྲུབ་པའི་ཕྱིར། །རྡོ་རྗེ་མཁའ་འགྲོ་མ་སྒྲུབ་ཐབས། །
en: “Next, I will explain The practice of Vajraḍākinī, In order to accomplish remote hearing.

source: ནམ་མཁའི་ཁམས་ཀྱི་དབུས་གཏོགས་པར། །ཉི་མའི་དཀྱིལ་འཁོར་མཆོག་བསམ་བྱ། །
en: “One should imagine a sublime sun disk Located in the center of the sky.

source: གནས་དེར་རྩེ་ལྔ་པ་ཡང་བསྒོམ། །དེ་ཡི་སྟེང་དུ་གནས་དགོད་བྱ། །
en: A five-pronged vajra should be visualized there, And a palace placed on top of that.

source: མཐིང་མདོག་ནག་པོ་འཇིགས་ཚུལ་ལ། །
en: “One should visualize her In a dark-blue, terrifying form.

source: ཕྱག་དྲུག་འཇིགས་སུ་རུང་བ་སྟེ། །ཕྱག་ན་རྡོ་རྗེ་རྣམ་བསྒོམ་བྱ། །ཕྱག་གཞན་དག་ལ་གཞན་དག་དགོད། །
en: She is six-armed and fearsome, With a vajra in one hand and the others in the rest.

source: ཤར་དུ་སངས་རྒྱས་མཁའ་འགྲོ་མ། །ཕྱག་དྲུག་གཏི་མུག་རྡོ་རྗེ་མཚུངས། །
en: “In the east is Buddhaḍākinī, Six-armed and resembling Mohavajra.

source: ལག་ན་འཁོར་ལོ་འཇིགས་པར་བྱེད། །བསྒོམ་བྱ་སྦྱོར་བའི་དཀྱིལ་འཁོར་དུ། །
en: Terrifying with a wheel in hand, She is visualized in the center of a yoga-maṇḍala.

source: ལྷོ་རུ་རིན་ཆེན་མཁའ་འགྲོ་མ། །ཕྱག་དྲུག་ཕྲ་མ་དང་མཚུངས་པ། །
en: “In the south is Ratnaḍākinī, Six-armed and resembling Piśuna.

source: ཕྱག་ན་རིན་ཆེན་རབ་འབར་བ། །ཉི་མའི་དཀྱིལ་འཁོར་བསྒོམ་པར་བྱ། །
en: Blazing brightly with a jewel in hand, She is visualized on the disk of the sun.

source: ནུབ་ཏུ་པདྨའི་མཁའ་འགྲོ་མ། །ཕྱག་དྲུག་པདྨ་འཛིན་པའོ། །
en: “In the west is Padmadākinī, Six-armed and holding a lotus.

source: བྱང་དུ་ལས་ཀྱི་མཁའ་འགྲོ་མ། །རལ་གྲི་འཛིན་པའི་དཀྱིལ་འཁོར་རིམ་པའོ། །
en: In the north is Karmaḍākinī, On a bhaga maṇḍala holding a sword.

source: མེ་ལ་སོགས་པ་མཚམས་བཞི་རུ། །ལྷ་མོ་བསྒོམ་བྱ་བརྟུལ་ཞུགས་ཅན། །ལཱ་སྱེ་མཱ་ལེ་དེ་བཞིན་གར། །གླུ་མ་ཡི་ནི་ཁྱད་པར་རོ། །
en: “In the four corners, beginning in the west, The vow-holder should visualize the goddesses, Specifically Lāsyā and Mālyā, As well as Nṛtyā and Geyā.

source: ལས་ཀྱི་ཆོ་ག་མཐོང་བ་ཡིས། །དེར་ནི་སྒོ་སྐྱོང་བསྒོམ་པར་བྱ། །ཐོ་བ་དབྱིག་པ་དང་པདྨ། །དེ་བཞིན་གཞན་ནི་རལ་གྲིའོ། །ཨོྃ་བཛྲ་ཌཱ་ཀི་ནཱི།
en: “They should then focus on the door guardians By following the prescribed method: Mudgara, Daṇḍa, Padma, And the other one, Khaḍga.

source: ཨོྃ་བུདྡྷ་ཌཱ་ཀི་ནཱི། ཨོྃ་རཏྣ་ཌཱ་ཀི་ནཱི། ཨོྃ་པདྨ་ཌཱ་ཀི་ནཱི། ཨོྃ་ཀརྨྨ་ཌཱ་ཀི་ནཱི། ལྃ་ནྃ་གྃ་མྃ། མཚམས་སུའོ། །ཨོྃ་མུདྒར་ཛཿཨོཾ་དཎྜ་ཧཱུྃ། ཨོྃ་པདྨ་བྃ། ཨོྃ་ཁངྒ་ཧོཿ །འདི་ནི་བཅོམ་ལྡན་འདས་རྡོ་རྗེ་ཅན་གྱིས་རྡོ་རྗེ་མཁའ་འགྲོ་མའི་སྒྲུབ་ཐབས་གསུངས་པའོ། །
en: oṁ vajraḍākinī | oṁ buddhaḍākinī | oṁ ratnaḍākinī | oṁ padmaḍākinī | oṁ karmaḍākinī | And for the corners: laṁ naṁ gaṁ maṁ | oṁ mudgara jaḥ | oṁ daṇḍa hūṁ | oṁ padma vaṁ | oṁ khadga hoḥ | This is the practice of Vajraḍākinī taught by the blessed vajra bearer.

source: རིང་པོའི་ཐོས་པ་བསྒྲུབ་དོན་དུ། །རྡོ་རྗེ་མཁའ་འགྲོ་མ་བསྒོམ་བྱ། །
en: “To accomplish remote hearing One should visualize Vajraḍākinī.

source: དེར་ནི་གསང་སྔགས་ཀྱི་དངོས་གྲུབ་འགྲུབ་པར་འགྱུར་ཏེ། །
en: In that way the mantra siddhi is attained.

source: ཨོྃ་ཨཱ་ཀི་ཤ་ཙ་ར་བཛྲ་ཌཱ་ཀི་ནཱི་སྭཱ་ཧཱ། དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །རྡོ་རྗེས་འོག་སྒྲུབ་ཐབས་སོ། །
en: oṁ ākāśacara ḍākinīye hūṁ hūṁ phaṭ phaṭ svāhā | “Next, I will explain The practice of Vajrapātāla.

source: ས་འོག་རྣམ་པར་བསྒྲུབ་དོན་དུ། །གནོད་མཛེས་རྡོ་རྗེ་བསྒོམ་པར་བྱ། །
en: To attain the siddhi of moving underground One should visualize Śumbhavajra.

source: ཕྱག་དྲུག་མདོག་སྔོན་འཇིགས་པ་ཡི། །ཕྱག་ཏུ་གཏུན་ཤིང་དགོད་པར་བྱ། །དཀྱིལ་འཁོར་གྱི་ནི་དཀྱིལ་དག་ཏུ། །
en: “He has six arms, is blue and fearsome, Holds a pestle aloft in his hand, And is in the middle of the garbhamaṇḍala.

source: འདི་ནི་རབ་ཏུ་དགོད་པར་བྱ། །
en: This is how he is to be arranged.

source: ཤར་དུ་སྤྱན་མ་དགོད་པར་བྱ། །དེ་བཞིན་ལྷོ་རུ་མཱ་མ་ཀཱི། །ནུབ་ཏུ་ལྷ་མོ་གོས་དཀར་མོ། །སྒྲོལ་མ་བྱང་གི་ཕྱོགས་སུ་དགོད། །
en: “Locanā should be placed in the east, Māmakī in the south, The goddess Pāṇdarā in the west, And Tārā in the north.

source: མེ་ཏོག་སྤོས་དང་དེ་བཞིན་དྲི། །མར་མེ་ལ་སོགས་མཚམས་སུ་དགོད། །
en: “Puṣpā, Dhūpā, Gandhā, and Dīpā Should be placed in the east and so forth.

source: ཐོབ་ལ་སོགས་སྒོ་དྲུང་སྟེ། །སྦྲུལ་གྱིས་བརྒྱན་པའི་སྐ་རགས་བྱས། །
en: Mudgara and the rest stand in the doors, All wearing snakes as belts.

source: ལས་ཀྱི་ཆོ་ག་མཐོང་ནས་ནི། །དཀྱིལ་འཁོར་འདི་ལྟར་བསྒོམ་པར་བྱ། །
en: “One should visualize the maṇḍala in this way, Following the prescribed method.

source: རྡོ་རྗེ་ས་འོག་སྦྱོར་ལྡན་པས། །རྨི་ལམ་དུ་ནི་ལམ་མཐོང་འགྱུར། །
en: Those who train in Vajrapātāla Will see a path in their dreams.

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །བདུན་པའི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་ཏེ། །
en: “Next, I will explain The maṇḍala of the King of the Seven.

source: མཁའ་སྤྱོད་ཉིད་ནི་རབ་བསྒྲུབ་ཕྱིར། །རྟ་ཡི་མཆོག་ནི་རབ་ཏུ་བསྒྲུབ། །
en: In order to attain the power of flight, One should perfect Paramāśva.

source: ཕྱག་གཉིས་པ་ལ་ཞལ་གཅིག་པ། །སྐུ་མདོག་ལྗང་གུ་འཇིགས་པར་བྱེད། །
en: “He has two arms, one face, A dark-colored body, and is terrifying.

source: ཉི་མའི་དཀྱིལ་འཁོར་སྟེང་དུ་གཞག །རྟ་ཡི་གདོང་པ་རབ་མཛེས་པས། །
en: He stands on a sun disk And is beautiful, with face of a horse.

source: གཡས་པ་སྲད་བུ་ཁུ་ཚུར་བཅས། །ཕྱག་གཡོན་པ་ནི་ཐོད་པའོ། །
en: His right hand holds bean pods in a fist, And his left, a skull cup.

source: ཨོྃ་ཕུྃཤ་ཕུྃ་ཕུྃ་ཧི་ཧི་ཧི། གསང་སྔགས་འདི་ནི་མཁས་པས་བཟླ། །རྟ་ཡི་མཆོག་ཏུ་གྱུར་པར་གྲགས། །ཤར་དུ་བ་ཌ་བིཾ་བསྒོམ་བྱ། །
en: oṁ phuṁ phuṁ phuṁ hi hi hi | “The adept should recite this mantra For the renowned Paramāśva.

source: ལྷོ་ཕྱོགས་སུ་ནི་རིམ་གྲོ་མ། །ནུབ་ཏུ་བདུན་པའི་རྒྱལ་པོ་སྟེ། །རྟ་མཆོག་མ་ནི་བྱང་ཕྱོགས་དགོད། །
en: “In the east, visualize Vaḍavā, In the south Turaṅgamā, In the west Saptarājñī, And in the northern space, Paramāśvā.

source: བདག་པོའི་ཞལ་ཕྱག་ཇི་ལྟ་བར། །ཐམས་ཅད་དེ་དང་འདྲ་བར་བསྒོམ། །
en: “One should visualize their faces and arms To be like those of the central deity.

source: སྔགས་འདི་ཡིས་ནི་ཐམས་ཅད་དུ། །གཤེགས་སུ་གསོལ་བར་རབ་ཏུ་གྲགས། །
en: The request for them to arrive Resounds everywhere through this mantra.

source: སྨྱུག་མའི་གླིང་བུ་པི་བང་དང་། །རྔ་ཟླུམ་རྔ་བྲན་མཚམས་སུ་གཞག །བན་གླང་སྣ་དང་གླང་པོའི་སྣ། །
en: “In each of the corners one should place Bamboo and reed flutes, a lute, drum, and tabor.

source: དེ་བཞིན་གདོང་བཟང་གདོང་ངན་ཏེ། །གཏུན་ཤིང་དང་ནི་སྟ་རེ་དང་། །ལྕགས་ཀྱུ་དང་ནི་ཞགས་པ་དང་། །གར་ལ་སོགས་པའི་རྣལ་འབྱོར་གྱིས། །སྒོ་བཞི་རུ་ནི་རྟག་ཏུ་བསྒོམ། །
en: “Gokarṇa, Hastikarṇa, Sumukha, Durmukha, Muśāla, Paraśu, Aṅkuśa, and Pāśa Should be continuously visualized in the four doors, Engaged in dance and other dramatic acts.

source: སྔོ་ཆགས་གཡོན་པར་བསྒོམ་པར་བྱ། །རང་གི་ཕྱག་མཚན་དེ་བཞིན་གཡས། །ཇི་ལྟར་རྟ་མཆོག་སྔགས་ཀྱིས་ནི། །
en: Green shoots should be visualized in their left hands And, similarly, their emblems in their right.

source: རྡོ་རྗེ་ས་འོག་གི་ཡང་གཏེར། །
en: The mantra of Paramāśva Is the same as Vajrapātāla’s.

source: རྟ་མཆོག་རྣལ་འབྱོར་ཉིད་ཀྱིས་ནི། །ཁམས་གསུམ་ནམ་མཁའི་ཁམས་སུ་འགྱུར། །
en: By cultivating the practice of Paramāśva One becomes the space of the three worlds.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གསུང་ཐུགས་གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་དངོས་གྲུབ་ངེས་པར་བསྟན་པ་སྟེ་རིམ་པར་ཕྱེ་བ་བཅུ་གསུམ་པའོ།། །།
en: This was the thirteenth chapter, “Identifying the Siddhis,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: དེ་ལ་འདི་ནི་སྲད་བུ་བརྐྱང་བའི་དམ་ཚིག་གི་མཆོག་སྟེ། ཨ་ཀཱ་རོ་མུ་ཁྃ་སརྦཱ་དྷརྨཱཏྟཱུཾ། ཨཱདྱཱ་ནུད་པན་ན་ཏྭཱད། །དཔལ་ལྡན་གཤིན་རྗེའི་གཤེད་བསྒོམས་ལ། །སློབ་མ་རྣམ་སྣང་མཛད་དུ་བསྒོམ། །
en: Chapter 14: The Practice of Mañjuvajra “This is the supreme rite for the measuring cord: oṁ akāro mukhaṃ sarva­dharmāṇām ādyanutpannatvāt oṁ āḥ hūṁ phaṭ svāhā | “One should visualize themselves as glorious Yamāntaka And the disciple as Vairocana.

source: ཡེ་ཤེས་ཐིག་མཆོག་རྩེ་མོ་རྩེ། །ཤིན་ཏུ་མཉམ་པར་བཞག་ནས་བཏབ། །
en: Then, while meditatively composed, Set the supreme, preeminent wisdom cord.

source: དེ་ལ་འདི་ནི་དཀྱིལ་འཁོར་ཆེན་པོའི་དམ་ཚིག་མཆོག །ཨོྃ་ཨཱཿཧཱུྃ་དཀྱིལ་འཁོར་ཉིས་འགྱུར་རིམ་པར་བྱ། །དེ་ཡི་སྤོ་ཡི་ཉི་ཤུའི་ཚད། །བ་ཡི་རྣམ་ལྔ་མཉམ་བྱུགས་པའི། །སྐུད་པ་སངས་རྒྱས་ཀྱིས་རབ་བརྟགས། །
en: “This is the supreme samaya of the great maṇḍala:oṁ āḥ hūṁ | “The adept should prepare a cord That is smeared with the five cow products And is twice as long as the maṇḍala, With the doors being a twentieth of that.

source: དེ་ལ་འདི་ནི་རྡོ་རྗེ་ཆེན་པོ་གསོལ་བ་གདབ་པའི་དམ་ཚིག་གོ། །ཨེ་མའོ་སངས་རྒྱས་སློབ་དཔོན་ཆེ། །ཨེ་མའོ་ཆོས་དང་ཚོགས་ཀྱི་གཙོ། །དམ་ཚིག་དེ་ཉིད་བདག་ལ་སྩོལ། །
en: “This is the rite for the great vajra request: “O great master, a buddha, Lord of the Dharma assembly, Grant me the true samaya!

source: བྱང་ཆུབ་སེམས་ཀྱང་བདག་ལ་སྩོལ། །
en: Grant me the bodhicitta!

source: དེ་ལ་འདི་ནི་ས་ཆེན་པོ་ཡོངས་སུ་གཟུང་བའི་ཆོ་ག་སྟེ།
en: “This is the rite for the erecting the great site.

source: རྡོ་རྗེ་སའི་ལྷ་མོ་བཀུག་ལ། །ལྷ་མོ་ཁྱོད་ནི་དཔང་དུ་འགྱུར། །སྐྱོབ་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི། །སྤྱོད་པ་ཡི་ནི་ཁྱད་པར་དང་། །ས་དང་ཕ་རོལ་ཕྱིན་པ་ལའོ། །
en: Once the earth goddess has been summoned, one should say: ‘Devi, you bear witness To the unique conduct Of all the buddhas, the protectors, And to their perfections and levels.

source: སྒོ་ནི་དཀྱིལ་འཁོར་ཆ་བརྒྱད་དེ། །ཁྱམས་ཆེན་དག་ནི་བོར་བ་ལ། །བདག་ཉིད་ཆེན་པོས་ཤེས་པར་བྱ། །ཡིད་དུ་འོང་ཞིང་ལེགས་སྤྲས་པའི། །
en: “Supreme beings should know The doors to be an eighth of the maṇḍala, Excluding the great main hall, Which is pleasing and lavishly decorated.

source: མུ་ཁྱུད་སྒོ་ཙམ་ཤེས་པར་བྲི། །ལྷ་ཡི་སྣམ་བུའང་དེ་ཙམ་མོ། །རྡོ་རྗེ་ལྷ་མོ་ལྡན་པ་ཡིས། །གླུ་དང་རོལ་མོ་གར་ཡང་དགོད། །
en: “The crests should be known to be like the doors, As are the celestial moldings, Which are affixed with vajra apsarases Who are singing, playing instruments, and dancing.

source: མཆོད་སྣམ་སྒོ་ཡི་ཕྱེད་ཉིད་དེ། །འགྲམ་དང་ངོས་ཀྱང་དེ་ཙམ་མོ། །
en: “The altar is half the measure of the doors, As are the cheek moldings and the sides.

source: དོ་ཤལ་སེ་མོ་དོ་དང་ནི། །ཉི་མ་ཟླ་བ་མེ་ཏོག་ཕྲེང་། །དེ་ལ་གོས་དང་འཕན་དག་གོ། །
en: It also has long and short pearl strands, Moons, suns, flower garlands, Cloth hangings, and ribbons.

source: རྩ་བ་ས་ཡི་ཐིག་རྒྱབ་ཏུ། །ཚོན་རྩེའི་སྣམ་བུ་དེ་ཡི་ཕྱེད། །
en: “The colored ground is half of that And the base line is outside the grounds.
